//#2===================================================

    function sum(x) {

        var numX = x;

        function inner(y) {

            var numY = y;

            return numX + numY;

        }

        return inner;
    }

    console.log( sum(1)(2) ); // 3

//#3===================================================

var a = 5; // <=

(function() {
    console.log(a);
})(); // <=

//Ответ: отсутсвовали точки с запятой после объявления переменной и автовызова функции.

//#4===================================================

for (var i = 1; i <= 10; i++) {

    setTimeout( (function () {
        console.log(i)
    })(), 0);

}

//Ответы: 1) не хватало скобок в оформлении анонимной функции;
//        2) неправильное условие в цикле для вывода 1, 2 ... 10;
